{
    "profile": {
        "first_name": "Michael",
        "last_name": "Keil",
        "contact": {
            "address_one": "Raleigh, NC",
            "address_two": null,
            "phone": "(910) 336-3654"
        },
        "email": "w.michaelkeil@gmail.com",
        "description": "As a software tester rooted in best QA practices, I am highly capable \nof learning new software and technologies quickly, while ensuring that\nsoftware is successfully and thoroughly tested for production\nimplementation. With a dedication to quality, automation, a\npassion for foreign and computer languages, I would be an asset\nto your company. As an exceptional self-starter, I have\nthe confidence to build any kind of testing framework from scratch\nwith confidence.\n"
    },
    "experience": {
        "item0": {
            "position": "QA Engineer",
            "company": "Cisco (Insight Global)",
            "from": "April 2021",
            "to": "June 2023",
            "description": "Created a custom automated testing framework from scratch in Python for a multi-app platform container application with Selenium, Requests (Python API), Docker (container testing), and hooked up the testing pipeline with Jenkins to run in a testing lab. Currently adding new functionalities to said framework as well as adding new automated test cases, maintaining old ones for better testing coverage. \n"
        },
        "item1": {
            "position": "Testing Analyst/Automation Engineer",
            "company": "Independent Data Management (MyAgData)",
            "from": "May 2020",
            "to": "April 2021",
            "description": "Created an object-oriented automated web testing framework from scratch with Selenium, and a custom Selenium API test addition for Swagger API in C#. Maintain testing framework. Perform development to maintain internal support application (C# ASP.Net) Maintain testing pipeline in DevOps during each release for test results and issues.\n"
        },
        "item2": {
            "position": "Automation Engineer",
            "company": "SoftPro",
            "from": "July 2017",
            "to": "April 2020",
            "description": "Contributed to the creation of C# framework and maintained this automated framework using C#, Selenium and BDD in SpecFlow/Gherkin. Built and maintained tests using C# framework using Visual Studio. Found software bugs and tracked stories through VSTS using Agile methodology.\n"
        },
        "item3": {
            "position": "QA Automation Analyst",
            "company": "Infusion/Avanade (Charles Schwab)",
            "from": "April 2015",
            "to": "July 2017",
            "description": "Created, and maintained automated tests using customized C# and JavaScript framework with MTM, and TFS to test the flow of data in the MongoDB database and web services (REST). Documented, tracked, and reviewed test plans, cases, test results and anomalies found during product testing with Microsoft TFS, and MTM\n"
        }
    },
    "education": {
        "item1": {
            "institution": "Southern New Hampshire University/Ashford University",
            "program": "Associates in IT",
            "description": "Information Technology & supplemental Programming and Database courses",
            "from": "November 2015",
            "to": "November 2017"
        },
        "item2": {
            "institution": "Ashford University (Now The University of Arizona Global Campus)",
            "program": "Supplemental/Minor in Linguistics",
            "description": "Major in Mathematics with Mathematical Computing as terminal area.",
            "from": "Jan 2018",
            "to": "Jan 2019"
        }
    },
    "tools": [
        "python, C#,",
        "selenium, familiarity with cypress, robot, etc.",
        "gherkin language for BDD (specflow, cucumber, etc.)",
        "github, understanding of docker, jenkins, azure, etc.",
        "google-drive, apple, linux"
    ],
    "extra_skills": [
        "web test automation",
        "API, database testing (SQL and noSQL i.e. MongoDB)"
    ]
}